In [97]:
import numpy as np
import pandas as pd

In [98]:
df = pd.read_csv('salary_details.csv')

In [99]:
df

         Name  Salary*
0      Subodh       18
1      Nithin        9
2   Mrunmayee       12
3      Naveen       10
4        Ajin        6
5       Linux        7
6        Ajay        8
7        Ansh       16
8   Jayashree       11
9      Tarani       10
10        CEO     3132

In [100]:
df['Salary*'].describe()

count      11.000000
mean      294.454545
std       941.114272
min         6.000000
25%         8.500000
50%        10.000000
75%        14.000000
max      3132.000000
Name: Salary*, dtype: float64

In [101]:
df['Salary*'].quantile(0.99)

2820.6000000000013

6,7,8,9,10,10,11,12,16,18,3132

In [120]:
df['Salary*'].quantile(0.25)

8.25

In [102]:
percentile_99 = df['Salary*'].quantile(0.99)

In [103]:
df[df['Salary*']>percentile_99]

   Name  Salary*
10  CEO     3132

In [104]:
df_no_outlier = df[df['Salary*']<=percentile_99]

In [105]:
df_no_outlier

        Name  Salary*
0     Subodh       18
1     Nithin        9
2  Mrunmayee       12
3     Naveen       10
4       Ajin        6
5      Linux        7
6       Ajay        8
7       Ansh       16
8  Jayashree       11
9     Tarani       10

In [106]:
df['Salary*'].mean()

294.45454545454544

In [107]:
df_no_outlier['Salary*'].mean()

10.7

In [108]:
df['Salary*'].median()

10.0

In [109]:
df_no_outlier['Salary*'].median()

10.0

In [110]:
df['Salary*'].mode()

0    10
Name: Salary*, dtype: int64

In [111]:
df['Salary*'][3] = np.NaN

C:\Users\10726620\AppData\Local\Temp\ipykernel_2188\3788690898.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Salary*'][3] = np.NaN

In [112]:
df

         Name  Salary*
0      Subodh     18.0
1      Nithin      9.0
2   Mrunmayee     12.0
3      Naveen      NaN
4        Ajin      6.0
5       Linux      7.0
6        Ajay      8.0
7        Ansh     16.0
8   Jayashree     11.0
9      Tarani     10.0
10        CEO   3132.0

In [113]:
df1 = df.fillna(df['Salary*'].mean())

In [114]:
df1

         Name  Salary*
0      Subodh     18.0
1      Nithin      9.0
2   Mrunmayee     12.0
3      Naveen    322.9
4        Ajin      6.0
5       Linux      7.0
6        Ajay      8.0
7        Ansh     16.0
8   Jayashree     11.0
9      Tarani     10.0
10        CEO   3132.0

In [115]:
df2 = df.fillna(df['Salary*'].median())

In [116]:
df2

         Name  Salary*
0      Subodh     18.0
1      Nithin      9.0
2   Mrunmayee     12.0
3      Naveen     10.5
4        Ajin      6.0
5       Linux      7.0
6        Ajay      8.0
7        Ansh     16.0
8   Jayashree     11.0
9      Tarani     10.0
10        CEO   3132.0